danhper/fish-ssh-agent
franciscolourenco/done
gyakovlev/fish-fzy
igalic/anicode
jethrokuan/z
jorgebucaran/fish-bax
jorgebucaran/fish-nvm
joseluisq/gitnow
laughedelic/brew-completions
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-pj
Shadowigor/plugin-errno-grep
